app/controllers/trades_controller.rb

	def index
    @trades = Trade.all
---
SELECT "trades".* FROM "trades"